Revit 2027 API
Domain Enumeration
 Type of connector domain.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum Domain
Public Enumeration Domain
public enum class Domain
type Domain
Members
Member name | Value | Description
DomainCableTrayConduit | 4 |  Connector of cable trays or conduits
DomainElectrical | 2 |  Electrical connector
DomainHvac | 1 |  HVAC (duct) connector
DomainPiping | 3 |  Piping connector
DomainStructuralAnalytical | 5 |  Connector of Structural Analytical Model
DomainUndefined | 0 |  Domain is undefined
See Also
Reference
Autodesk.Revit.DB Namespace